app/Models/CustomersModel.php

    public function addCustomer($userid)
    {
      $data['userid'] = $userid;
      return $this->insert($data);
---
INSERT INTO "customer" ("userid") VALUES (('40'))