app/Models/FlyModel.php

    public function getDescription($id)
    {
        if(is_array($id)){
            $fly =array();
        foreach ($id as $flycode){
            $rs = $this->select('description')->where(['fly_code'=>$flycode])->findAll();
---
SELECT "description"
FROM "fly"
WHERE "fly_code" = 'A00103'

    public function getSize($id)
    {
        if(is_array($id)){
            $fly =array();
        foreach ($id as $flycode){
            $rs = $this->select('size')->where(['fly_code'=>$flycode])->findAll();
---
SELECT "size"
FROM "fly"
WHERE "fly_code" = 'A00103'