app/Models/JobsModel.php

SELECT "orderid"
FROM "job"
---
    public function getOrderid($jobid)
    {
        if (!$jobid) {
            return $this->select('orderid')->findAll();