app/Models/OrdersModel.php

    public function getFlycode($orderid)
    {

        if (is_array($orderid)) {
            $flycodes = array();
            foreach($orderid as $id){
                $flycode = $this->select('fly_code')->where('orderid',$id)->first();
---
SELECT "fly_code"
FROM "orders"
WHERE "orderid" = '4'
 LIMIT 1

    public function totalOrderCount():int
    {
        return $this->countAllResults();
---
SELECT COUNT(*) AS "numrows"
FROM "orders"