app/Models/StaffModel.php

SELECT "userid"
FROM "staff"
WHERE "staffid" = '2'
---
   public function getUserid($staffid){
     if(is_array($staffid))
     {
        $userIds = array();
        foreach ($staffid as $id) {
            $result = $this->select('userid')->where('staffid', $id)->findAll();