app/Models/UsersModel.php

            'type'    => $type
        ];

        $status = $this->insert($data);
---
INSERT INTO "users" ("name", "username", "password", "type") VALUES ('user6000', 'name', '$2y$10$7Lb6gt/W5cqRRDDjmj.pYO6w1mn7bf3MuCKc9/sN2nSUorGgx.ZK.', 'customer')

    public function getByUsername($username)
    {
        return $this->where(['username'=>$username])->first();
---
SELECT *
FROM "users"
WHERE "username" = 'name'
 LIMIT 1

    public function login($username, $password)
    {
        $user = $this->where('username', $username)->first();
---
SELECT *
FROM "users"
WHERE "username" = 'admin'
 LIMIT 1

    public function totalUserCount():int
    {
        return $this->countAllResults();
---
SELECT COUNT(*) AS "numrows"
FROM "users"

    public function getNamebyid($userid)
    {
        if(is_array($userid))
     {
        $userNames = array();
        foreach ($userid as $id) {
            $result = $this->select('name')->where('userid', $id)->findAll();
---
SELECT "name"
FROM "users"
WHERE "userid" = '18'

    public function getLastInsertId($username)
    {
        return $this->select('userid')->where(['username' => $username])->first();
---
SELECT "userid"
FROM "users"
WHERE "username" = 'name'
 LIMIT 1